import React from 'react'

 function AmEs5_1() {
  return (
    <div>
      <h1>JavaScript</h1>
<p>
JavaScript-ը ստեղծվել է 1995 թվականին  Բրենդան Այքի կողմից, երբ աշխատում էր Netscape Communications Corporation-ում:
Լեզուն սկզբում կոչվել է Mocha, սակայն հետագայում վերանվանվել է LiveScript, իսկ հետո վերջապես JavaScript։
Վերանվանումը տեղի է ունեցել հիմնականում մարքեթինգային նկատառումներով և այն ժամանակվա Java-ի ճանաչվածությունից օգտվելու համար:
Բրենդան Այքը ամերիկացի տեխնոլոգ և ծրագրավորող է, ով աշխատել է Mozilla-ում, Netscape-ում և Brave Software-ում:
Նա համարվում է JavaScript-ի ստեղծողը և նշանակալի ներդրում է ունեցել ծրագրավորման այլ լեզուների զարգացման գործում։
</p>

<h3>ECMAScript-ը սահմանում է տվյալների 7 տեսակ:</h3>

<ul>
   <li>Number. ներկայացնում է թվային արժեքներ, ներառյալ ամբողջ թվերը և լողացող կետային համարները: Օրինակներ՝ 1, 3.14, -42.</li>
   
   <li>String. ներկայացնում է տեքստային տվյալները, որոնք փակցված են մեկ կամ կրկնակի չակերտներով: Օրինակներ՝ «բարև», «աշխարհ», «123»:</li>
   
   <li>Boolean. ներկայացնում է բուլյան էություն և կարող է ունենալ միայն երկու արժեք՝ true կամ false: Օրինակներ՝ ճշմարիտ, կեղծ:</li>
   
   <li>Undefined. ներկայացնում է փոփոխական, որը հայտարարվել է, բայց արժեք չի նշանակվել: Օրինակներ՝ var x; console.log (x); // Ելք՝ undefined</li>
   
   <li>Null. Ներկայացնում է որևէ օբյեկտի արժեքի միտումնավոր բացակայությունը: Օրինակներ՝ var x = null; console.log (x); // Ելք՝ null</li>
   
   <li>Symbol. ներկայացնում է եզակի նույնացուցիչ, որը հասանելի չէ զանգող կոդի համար: Օրինակ՝ const sym1 = Symbol('foo');</li>
   
   <li>Object. հարակից տվյալների և/կամ գործառույթների հավաքածու է: Օրինակներ՝ var obj = {'{'} անուն՝ «Ջոն», տարիք՝ 30 {'}'}; var arr = [1, 2, 3];</li>

</ul>

<h2>Բուլյան տվյալների տեսակը</h2>

<p>Բուլյան տվյալների տեսակն ունի միայն երկու արժեք՝ true և false: Այն հաճախ օգտագործվում է համեմատական ​​գործողություններում՝ օգտագործելով հետևյալ օպերատորները.</p>

    </div>
  )
}


export default AmEs5_1;